package test0130;

public class OperEx1 {
	public static void main(String[] args) {
		int a,b;
		
		a=10;
		b=++a; // 전위++ : 1증가 후,연산
		/*
		 a=a+1;
		 b=a;
		 */
		System.out.println(a+","+b); //11,11
//-------------------------------------------------------------
		a=10;
		b=a++; // 후위++ , 연산 후, 1증가
		/*
		 b=a;
		 a=a+1;
		 */
		System.out.println(a+","+b); //11,10
//-------------------------------------------------------------	
		a=10;
		b=--a; // 전위-- : 1감소 후,연산
		/*
		 a=a-1;
		 b=a;
		 */
		System.out.println(a+","+b); //9,9
//-------------------------------------------------------------		
		a=10;
		b=a--; // 후위-- , 연산 후, 1감소
		/*
		 b=a;
		 a=a-1;
		 */
		System.out.println(a+","+b); //9,10
//-------------------------------------------------------------		
		a=10;
		++a;
		System.out.println(a); //11
//-------------------------------------------------------------	
		a=10;
		a++;
		System.out.println(a); //11
	}

}
